stubs/libxml2/samples/9bbc4fb8b693258c97a03e7ae0eceb87b6425c45

<?xml version="1.0" encoding="UTF-8"?>
<l:log xmlns:l="http://www.w3.org/2002/ws/addressing/logs/">
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1100" timestamp="2006-03-06T20:35:16.578" conversation="1" wsi-log303:ID="1" type="request" message="1">
    <l:content><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://www.w3.org/2005/08/addressing"><soapenv:Header><wsa:To>http://soapinterop.java.sun.com:8080/jaxwsa-w3c_s11/cr</wsa:To><wsa:Action>http://example.org/action/notify</wsa:Action><wsa:MessageID>uuid:D145588A-0109-4000-E000-0D300A000008</wsa:MessageID></soapenv:Header><soapenv:Body><m:notify xmlns:m="http://example.org/notify">test1100</m:notify></soapenv:Body></soapenv:Envelope></l:content>
    <senderHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">127.0.0.1:1559</senderHostAndPort>
    <receiverHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">soapinterop.java.sun.com:8080</receiverHostAndPort>
    <httpHeaders xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">POST /jaxwsa-w3c_s11/cr HTTP/1.1&#13;
Host: localhost:8001&#13;
Accept: application/soap+xml,multipart/related,text/*&#13;
User-Agent: IBM WebServices/1.0&#13;
Cache-Control: no-cache&#13;
Pragma: no-cache&#13;
SOAPAction: "http://example.org/action/notify"&#13;
Connection: Keep-Alive&#13;
Content-Type: text/xml; charset=utf-8&#13;
Content-Length: 775&#13;
Date: Mon, 06 Mar 2006 20:35:15 GMT&#13;
&#13;
</httpHeaders>
  </l:message>
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1100" timestamp="2006-03-06T20:35:17.078" conversation="1" wsi-log303:ID="2" type="response" message="2">
    <l:content/>
    <senderHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">soapinterop.java.sun.com:8080</senderHostAndPort>
    <receiverHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">127.0.0.1:1559</receiverHostAndPort>
    <httpHeaders xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">HTTP/1.1 202 Accepted&#13;
Server: Apache-Coyote/1.1&#13;
Transfer-Encoding: chunked&#13;
Date: Mon, 06 Mar 2006 20:45:04 GMT&#13;
&#13;
</httpHeaders>
  </l:message>
  <l:message xmlns:wsi-log303="http://www.ws-i.org/testing/2003/03/log/" xmlns:wsi-log407="http://www.ws-i.org/testing/2004/07/log/" testcase="test1101" timestamp="2006-03-06T20:35:17.188" conversation="1" wsi-log303:ID="3" type="request" message="1">
    <l:content><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://www.w3.org/2005/08/addressing"><soapenv:Header><wsa:To>http://soapinterop.java.sun.com:8080/jaxwsa-w3c_s11/cr</wsa:To><wsa:Action>http://example.org/action/notify</wsa:Action><wsa:MessageID>uuid:D1455C14-0109-4000-E000-0D300A000008</wsa:MessageID></soapenv:Header><soapenv:Body><m:notify xmlns:m="http://example.org/notify">test1101</m:notify></soapenv:Body></soapenv:Envelope></l:content>
    <senderHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">127.0.0.1:1559</senderHostAndPort>
    <receiverHostAndPort xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">soapinterop.java.sun.com:8080</receiverHostAndPort>
    <httpHeaders xmlns:wsi-monConfig="http://www.ws-i.org/testing/2003/03/monitorConfig/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.ws-i.org/testing/2003/03/log/">POST /jaxwsa-w3c_s11/cr HTTP/1.1&#13;
Host: localhost:8001&#13;
Accept: application/soap+xml,multipart/related,text/*&#13;
User-Agent: IBM WebServices/1.0&#13;
Cache-Contr